app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2017-03-01 19:16:01.702179"], ["id", 1]]
---
  def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(params.require(:school_class).permit(:title))